docs: MD 파일의 PlantUML 다이어그램을 Mermaid 버전으로 변경
